snlkuharlocal/src/InformationRegisters/НастройкиОбъектов/НастройкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбъектов</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НастройкиПоУмолчанию</name>
      <description>Настройки по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонГородской</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Интерфейс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактированиеДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПросмотрДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаСоСклада</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриемкаНаСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДатыЗапрета</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРедактирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заместители</name>
    <attributes>
      <name>Заместитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеВидыОтчетов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСостоянияДокументов</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/Отчеты/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
//РАБОТА С РЕГИСТРОМ НАСТРОЕК
Функция ПрочитатьНастройку(ТипОбъекта,ИмяОбъекта,ИмяНастройки,Знач Пользователь=Неопределено) Экспорт
	Пользователь=?(Пользователь=Неопределено,ПараметрыСеанса.Пользователь,Пользователь);
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
	|ГДЕ
	|	ТипОбъекта		= &ТипОбъекта
	|	И ИмяОбъекта	= &ИмяОбъекта
	|	И ИмяНастройки	= &ИмяНастройки
	|	И Пользователь	= &Пользователь";
	
	Запрос.УстановитьПараметр("ТипОбъекта",ТипОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта",ИмяОбъекта);
	Запрос.УстановитьПараметр("ИмяНастройки",ИмяНастройки);
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		попытка
			Возврат Выборка.ЗначениеНастройки.Получить();	
		исключение
			прервать;
		Конецпопытки;
	КонецЦикла; 	
	Возврат Неопределено;	
КонецФункции // ПолучитьНастройку()

Функция ЗаписатьНастройку(Настройка,ТипОбъекта,ИмяОбъекта,ИмяНастройки,Знач Пользователь=Неопределено) Экспорт
	Пользователь=?(Пользователь=Неопределено,ПараметрыСеанса.Пользователь,Пользователь);
	
	Запись=РегистрыСведений.НастройкиОбъектов.СоздатьМенеджерЗаписи();
	Запись.ТипОбъекта		=ТипОбъекта;
	Запись.ИмяОбъекта		=ИмяОбъекта;
	Запись.ИмяНастройки		=ИмяНастройки;
	Запись.Пользователь		=Пользователь;
	
	Запись.ЗначениеНастройки=Новый ХранилищеЗначения(Настройка);
	
	Запись.ДатаМодификации	=ТекущаяДата();
	
	Запись.Записать();	
КонецФункции // ЗаписатьНастройку()

///////////////////////////////////////////////////////////////////////////////////
//СОЗАНИЕ ФОРМАТИРОВАНИЕ ДЕРЕВЬЕВ НАСТРОЕК
Функция СоздатьКолонкиДереваНастроек(Форма,ИмяДерева)	
	Дерево=Форма[ИмяДерева];
	
	Если Дерево.Колонки.Найти("Имя")=Неопределено Тогда			
		Дерево.Колонки.Добавить("Имя",Новый ОписаниеТипов("Строка"));				
	КонецЕсли; 
	Если Дерево.Колонки.Найти("Значение")=Неопределено Тогда	
		Дерево.Колонки.Добавить("Значение");				
	КонецЕсли;
	Если Дерево.Колонки.Найти("Заголовок")=Неопределено Тогда	
		Дерево.Колонки.Добавить("Заголовок");				
	КонецЕсли;
	Если Дерево.Колонки.Найти("ИспользоватьКакРасшифровку")=Неопределено Тогда	
		Дерево.Колонки.Добавить("ИспользоватьКакРасшифровку",Новый ОписаниеТипов("Булево"));				
	КонецЕсли;
	
	Если Дерево.Строки.Количество()=0 Тогда
		СтрокаДерева=Дерево.Строки.Добавить();
		СтрокаДерева.Имя="Основная";
	КонецЕсли;
КонецФункции // СоздатьКолонкиДереваНастроек()

Процедура ОтформатироватьДеревоНастроек(Форма,ИмяДерева)
	Форма.ЭлементыФормы[ИмяДерева].СоздатьКолонки();
	Форма.ЭлементыФормы[ИмяДерева].Колонки["Имя"].Ширина 		= 10;
	Форма.ЭлементыФормы[ИмяДерева].Колонки["Значение"].Видимость= Ложь;	
	Форма.ЭлементыФормы[ИмяДерева].Колонки["Заголовок"].Ширина	= 4;
КонецПроцедуры 

///////////////////////////////////////////////////////////////////////////////////
// ПОЛУЧЕНИЕ УСТАНОВКА ТЕКУЩЕЙ СТРОКИ ДЕРЕВА НАСТРОЕК
Функция  ПолучитьИндексТекущейСтрокиДерева(Дерево) Экспорт	
	СтрокаИндекса="";
	
	ТекСтрока=Дерево.ТекущаяСтрока;	
	Если ТекСтрока<>Неопределено Тогда
		Пока ТекСтрока.Родитель<>Неопределено Цикл
			СтрокаИндекса=""+ТекСтрока.Родитель.Строки.Индекс(ТекСтрока)+?(ПустаяСтрока(СтрокаИндекса),"",",")+СтрокаИндекса;		
			ТекСтрока=ТекСтрока.Родитель;
		КонецЦикла;	
		СтрокаИндекса=""+Дерево.Значение.Строки.Индекс(ТекСтрока)+?(ПустаяСтрока(СтрокаИндекса),"",",")+СтрокаИндекса;		
	КонецЕсли;
	
	Возврат СтрокаИндекса;
КонецФункции

Процедура ВосстановитьПозициюДерева(ДеревоЭУ,Индекс)
	Дерево=ДеревоЭУ.Значение;
	
	ТекСтрокаДерева=Дерево;	
	ТекСтрока=Индекс;		
	Если ТекСтрокаДерева.Строки.Количество()>0 Тогда
		Попытка
			Поз=Найти(ТекСтрока,",");
			Пока Поз<>0 Цикл		
				ТекСтрокаДерева=ТекСтрокаДерева.Строки.Получить(Число(Лев(ТекСтрока,Поз-1)));
				
				ТекСтрока=Сред(ТекСтрока,Поз+1);		
				Поз=Найти(ТекСтрока,",");
			КонецЦикла;
			Если СтрДлина(ТекСтрока)>0 Тогда
				ТекСтрокаДерева=ТекСтрокаДерева.Строки.Получить(Число(ТекСтрока));
				
				ДеревоЭУ.ТекущаяСтрока=ТекСтрокаДерева;				
			КонецЕсли; 			
		Исключение
			Сообщить("Ошибка установки текущей строки ! "+ОписаниеОшибки());
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
//ВЫДЕЛЕНИЕ СТРОК ДЕРЕВА НАСТРОЕК
Процедура СнятьВыделениеТекущейСтрокиТП(ТП)
	Если ТП.ТекущаяСтрока<>Неопределено Тогда
		ТП.ВыделенныеСтроки.Удалить(ТП.ТекущаяСтрока);
	КонецЕсли; 
КонецПроцедуры

Процедура УстановитьВыделениеТекущейСтрокиТП(ТП)
	Если ТП.ТекущаяСтрока<>Неопределено Тогда
		ТП.ВыделенныеСтроки.Добавить(ТП.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры 

///////////////////////////////////////////////////////////////////////////////////
//ОБРАБОТКА СОБЫТИЙ ДЕРЕВА НАСТРОЕК
Процедура АктивизацияСтрокиДереваНастроек(Форма,Элемент) Экспорт
	
	ИмяАктивногоДереваНастроек=Элемент.Имя;	
	
	Если ИмяАктивногоДереваНастроек="ДеревоНастроекПользователя" Тогда	
		СнятьВыделениеТекущейСтрокиТП(Форма.ЭлементыФормы.ДеревоОбщихНастроек);	
		ВыборСтрокиДереваНастроек(Форма,Элемент.ТекущаяСтрока);		
		УстановитьВыделениеТекущейСтрокиТП(Форма.ЭлементыФормы.ДеревоНастроекПользователя);
	ИначеЕсли ИмяАктивногоДереваНастроек="ДеревоОбщихНастроек" Тогда 
		СнятьВыделениеТекущейСтрокиТП(Форма.ЭлементыФормы.ДеревоНастроекПользователя);						
		ВыборСтрокиДереваНастроек(Форма,Элемент.ТекущаяСтрока);
		УстановитьВыделениеТекущейСтрокиТП(Форма.ЭлементыФормы.ДеревоОбщихНастроек);	
	КонецЕсли;	
КонецПроцедуры

Процедура ВыборСтрокиДереваНастроек(Форма,ВыбраннаяСтрока)	Экспорт
	Если ВыбраннаяСтрока<>Неопределено И ВыбраннаяСтрока.Значение<>Неопределено Тогда
		Форма.ВосстановитьНастройкуОтчета(ВыбраннаяСтрока.Значение);		
	Иначе
		Форма.ВосстановитьНастройкуОтчета();		
	КонецЕсли;    
КонецПроцедуры 

///////////////////////////////////////////////////////////////////////////////////
// СОХРАНЕНИЕ ВОССТАНОВЛЕНИЕ ПОЛНЫХ НАСТРОЕК ОТЧЕТА
Функция АктивноеДеревоНастроек(Форма) Экспорт
	СписокДеревьев=Новый Структура("ДеревоОбщихНастроек,ДеревоНастроекПользователя");
	
	Для Каждого Дерево Из СписокДеревьев Цикл
		Если Форма.ЭлементыФормы[Дерево.Ключ].ВыделенныеСтроки.Количество()<>0 Тогда
			Возврат Дерево.Ключ;			
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции // АктивноеДеревоНастроек()

//сохраняет в дереве настроек текущую настройку отчета
Процедура СохранитьНастройку(Форма)	Экспорт
	ИмяАктивногоДереваНастроек	=АктивноеДеревоНастроек(Форма);
	ДеревоНастроек				=Форма.ЭлементыФормы[ИмяАктивногоДереваНастроек];
	
	ТекСтрока					=ДеревоНастроек.ТекущаяСтрока;		
	Если ТекСтрока<>Неопределено Тогда		
		Если ИмяАктивногоДереваНастроек="ДеревоНастроекПользователя" Тогда						
			ТекСтрока.Значение=Форма.ПолучитьНастройкуОтчета();
			СохранитьНастройкиОтчета(Форма,"НастройкиПользователя");
		ИначеЕсли ИмяАктивногоДереваНастроек="ДеревоОбщихНастроек" Тогда
			Если ПолучитьПолномочиеПользователя("СохранятьНастройкиОтчетов") Тогда
				ТекСтрока.Значение=Форма.ПолучитьНастройкуОтчета();
				СохранитьНастройкиОтчета(Форма,"ОбщиеНастройки");				
			Иначе
				Предупреждение("Недостаточно прав для сохранения общих настроек !");
			КонецЕсли;		
		КонецЕсли;		
	Иначе
		Предупреждение("Не выбрана строка дерева настроек !!!");
	КонецЕсли;	
КонецПроцедуры

//сохраняет деревья настроек, позиции даты и т.д.
Процедура СохранитьНастройкиОтчета(Форма,Вид=Неопределено) Экспорт
	ОтчетОбъект=Форма.ЭтотОбъект;
	ИмяОтчета=Форма.Метаданные().Имя;
	
	Если Форма.Метаданные().Реквизиты.Найти("ВидОтчета")<>Неопределено Тогда
		ИмяОтчета=ИмяОтчета+"_"+Форма.ВидОтчета.Код;
	КонецЕсли;
	
	Если Вид="НастройкиПользователя" ИЛИ Вид="Все" Тогда
		Настрока=Новый Структура("Дерево",ОтчетОбъект.ДеревоНастроекПользователя);
		ЗаписатьНастройку(Настрока,"Отчет",ИмяОтчета,"НастрокиПользователя");
	ИначеЕсли Вид="ОбщиеНастройки" ИЛИ Вид="Все" Тогда
		Настрока=Новый Структура("Дерево",ОтчетОбъект.ДеревоОбщихНастроек);
		ЗаписатьНастройку(Настрока,"Отчет",ИмяОтчета,"ОбщиеНастройки",Справочники.Пользователи.НастройкиПоУмолчанию);				
	КонецЕсли;
		
	НастройкиФормы=Новый Структура("ИндексСтрокиДереваНастроекПользователя,
									|ИндексСтрокиДереваОбщихНастроек,
									|ИмяАктивногоДереваНастроек,									
									|Дата1,Дата2",
									ПолучитьИндексТекущейСтрокиДерева(Форма.ЭлементыФормы.ДеревоНастроекПользователя),
									ПолучитьИндексТекущейСтрокиДерева(Форма.ЭлементыФормы.ДеревоОбщихНастроек),
									АктивноеДеревоНастроек(Форма),
									Форма.Дата1,Форма.Дата2);
	//крохин начало 18.04.2017								
	Попытка	
		ДопНастройки=Форма.ПолучитьДопНастройкиОтчета();
		НастройкиФормы.Вставить("ДопНастройки",ДопНастройки);	
	Исключение	
	КонецПопытки;
	//крохин конец 18.04.2017								
	ЗаписатьНастройку(НастройкиФормы,"Отчет",ИмяОтчета,"НастройкиФормы");	
КонецПроцедуры

//восстанавливает деревья настроек, позиции даты и т.д.
Процедура ВосстановитьНастройкиОтчета(Форма) Экспорт
	ИмяОтчета=Форма.Метаданные().Имя;
	
	Если Форма.Метаданные().Реквизиты.Найти("ВидОтчета")<>Неопределено Тогда
		ИмяОтчета=ИмяОтчета+"_"+Форма.ВидОтчета.Код;
	КонецЕсли; 
	
	НастрокиФормы=ПрочитатьНастройку("Отчет",ИмяОтчета,"НастройкиФормы");	
	Если НастрокиФормы<>Неопределено Тогда
		ИндексСтрокиДереваНастроекПользователя	=НастрокиФормы["ИндексСтрокиДереваНастроекПользователя"];
		ИндексСтрокиДереваОбщихНастроек			=НастрокиФормы["ИндексСтрокиДереваОбщихНастроек"];
		
		АктивноеДерево							=НастрокиФормы["ИмяАктивногоДереваНастроек"];
		
		Форма.Дата1								=НастрокиФормы["Дата1"]; 
		Форма.Дата2								=НастрокиФормы["Дата2"]; 		
		//крохин начало 18.04.2017
		ДопНастройки=Неопределено;
		Если НастрокиФормы.Свойство("ДопНастройки",ДопНастройки) Тогда
			Для Каждого Элемент Из ДопНастройки Цикл
				Форма[Элемент.Ключ]=Элемент.Значение;							
			КонецЦикла;		
		КонецЕсли;
		//крохин конец 18.04.2017
	Иначе		
		ИндексСтрокиДереваНастроекПользователя	="";
		ИндексСтрокиДереваОбщихНастроек			="";
		
		АктивноеДерево							="ДеревоНастроекПользователя";
		
		Форма.Дата1								=НачалоМесяца(ТекущаяДата()); 
		Форма.Дата2								=КонецМесяца(Форма.Дата1);	
	КонецЕсли; 
	
	Если АктивноеДерево="ДеревоНастроекПользователя" ИЛИ АктивноеДерево="ДеревоОбщихНастроек" Тогда
	Иначе
		АктивноеДерево="ДеревоОбщихНастроек";			
	КонецЕсли; 
		
	Настрока=ПрочитатьНастройку("Отчет",ИмяОтчета,"НастрокиПользователя");	
	Если Настрока<>Неопределено Тогда
		Форма.ДеревоНастроекПользователя=Настрока["Дерево"];		
	Иначе
		СоздатьКолонкиДереваНастроек(Форма,"ДеревоНастроекПользователя");
	КонецЕсли;	
	
	Настрока=ПрочитатьНастройку("Отчет",ИмяОтчета,"ОбщиеНастройки",Справочники.Пользователи.НастройкиПоУмолчанию);	
	Если Настрока<>Неопределено Тогда
		Форма.ДеревоОбщихНастроек=Настрока["Дерево"];
	Иначе
		СоздатьКолонкиДереваНастроек(Форма,"ДеревоОбщихНастроек");		
	КонецЕсли;
	
	ОтформатироватьДеревоНастроек(Форма,"ДеревоОбщихНастроек");
	ОтформатироватьДеревоНастроек(Форма,"ДеревоНастроекПользователя");
	
	ВосстановитьПозициюДерева(Форма.ЭлементыФормы.ДеревоОбщихНастроек,			ИндексСтрокиДереваОбщихНастроек);		
	ВосстановитьПозициюДерева(Форма.ЭлементыФормы.ДеревоНастроекПользователя,	ИндексСтрокиДереваНастроекПользователя);	
	
	Форма.ТекущийЭлемент=Форма.ЭлементыФормы[АктивноеДерево];
	АктивизацияСтрокиДереваНастроек(Форма,Форма.ТекущийЭлемент);	
	
		Если ЗначениеЗаполнено(ПараметрыСеанса.ДатаЗапретаВидимости) Тогда
			//крохин начало
			//по просьбе Филиппова
			Дата1 = НачалоМесяца(ТекущаяДата());
			Дата2 = ТекущаяДата();
		//	Дата1=ПараметрыСеанса.ДатаЗапретаВидимости;
		//	Дата2=КонецМесяца(ПараметрыСеанса.ДатаЗапретаВидимости);
		//крохин конец
		КонецЕсли;

КонецПроцедуры


Процедура ЗаписатьФормированиеОтчета(Форма, ДопИнфо = Неопределено, НастройкиОтчета = Неопределено, ВремяВыполнения = Неопределено) Экспорт
	ИмяЛога = ?(ВремяВыполнения = Неопределено ИЛИ ВремяВыполнения = 0.01, "ЗапускОтчетов", "ВремяВыполненияОтчетов");  
	
	//+++Чирков 12.05.2025
	Части = Новый Массив;
	Части.Добавить(Форма.Метаданные().Имя);	
	Если НЕ СтрНачинаетсяС(СокрЛП(ДопИнфо), "(") Тогда
		Части.Добавить(СокрЛП(ДопИнфо));						
	КонецЕсли;
	
	ЗаписатьВЛог(ИмяЛога, СтрСоединить(Части, "."), "Информация", , НастройкиОтчета,ВремяВыполнения);
	//---Чирков 12.05.2025
КонецПроцедуры

//крохин начало
Процедура ЗаписатьФормированиеОбработки(Форма,ДопИнфо=Неопределено) Экспорт	
	ЗаписатьВЛог("ЗапускОбработки",""+Форма.Метаданные().Имя+". "+ДопИнфо,"Информация");
КонецПроцедуры
//крохин конец


Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеТабличногоДокумента) Экспорт	
	Сумма = 0;
	Для Каждого Область Из ПолеТабличногоДокумента.ВыделенныеОбласти Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Для ИндексСтрока = Область.Верх По Область.Низ Цикл
				Для ИндексКолонка = Область.Лево По Область.Право Цикл
					Попытка
						Сумма = Сумма + Число(СтрЗаменить(ПолеТабличногоДокумента.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сумма;	
КонецФункции

Процедура ОтобразитьСуммуЯчеек(Форма,Элемент) Экспорт
	ЭФ	= Форма.ЭлементыФормы;	
	ЭФ.ПолеСумма.Значение = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Элемент);
КонецПроцедуры
